In [1]:
import numpy as np
import pandas as pd

### Basic Aggregations

In [2]:
data = {'Product':['A','B','C','A','B','C','A','B','C'],
        'Region':['North','South','East','West','North','South','East','West','North'],
        'Units_Sold':[10,15,20,5,10,15,10,5,15],
        'Price':[100,200,150,100,200,150,100,200,150]}

In [3]:
df_sales = pd.DataFrame(data)
df_sales

  Product Region  Units_Sold  Price
0       A  North          10    100
1       B  South          15    200
2       C   East          20    150
3       A   West           5    100
4       B  North          10    200
5       C  South          15    150
6       A   East          10    100
7       B   West           5    200
8       C  North          15    150

In [4]:
df_sales['Revenue'] = df_sales['Units_Sold'] * df_sales['Price']
df_sales

  Product Region  Units_Sold  Price  Revenue
0       A  North          10    100     1000
1       B  South          15    200     3000
2       C   East          20    150     3000
3       A   West           5    100      500
4       B  North          10    200     2000
5       C  South          15    150     2250
6       A   East          10    100     1000
7       B   West           5    200     1000
8       C  North          15    150     2250

In [8]:
total_units_sold = df_sales['Units_Sold'].sum()
total_units_sold

np.int64(105)

In [9]:
total_revenue = df_sales['Revenue'].sum()
total_revenue

np.int64(16000)

In [12]:
average_units_sold = df_sales['Units_Sold'].mean().round(2)
average_units_sold

np.float64(11.67)

In [13]:
average_revenue = df_sales['Revenue'].mean().round(2)
average_revenue

np.float64(1777.78)

### Grouping Data

In [15]:
df_sales_summary = df_sales.groupby('Product').agg({'Units_Sold': 'sum', 'Revenue': 'sum'})
df_sales_summary

         Units_Sold  Revenue
Product
A                25     2500
B                30     6000
C                50     7500

In [16]:
df_sales_summ2 = df_sales.groupby('Region').agg({'Units_Sold':'mean', 'Revenue': 'mean'})
df_sales_summ2

        Units_Sold  Revenue
Region
East     15.000000   2000.0
North    11.666667   1750.0
South    15.000000   2625.0
West      5.000000    750.0

In [17]:
df_sales_summary3 = df_sales.groupby(['Product', 'Region']).agg({'Units_Sold': 'sum', 'Revenue': 'sum'})
df_sales_summary3

                Units_Sold  Revenue
Product Region
A       East            10     1000
        North           10     1000
        West             5      500
B       North           10     2000
        South           15     3000
        West             5     1000
C       East            20     3000
        North           15     2250
        South           15     2250

### Sorting and Ranking Data

In [18]:
df_sales['Units_Sold'].sort_values()

3     5
7     5
4    10
0    10
6    10
1    15
5    15
8    15
2    20
Name: Units_Sold, dtype: int64

In [20]:
df_sales['Revenue'].sort_values(ascending = False)

1    3000
2    3000
8    2250
5    2250
4    2000
0    1000
6    1000
7    1000
3     500
Name: Revenue, dtype: int64

In [22]:
df_sales['Revenue_Rank'] = df_sales['Revenue'].rank(ascending = False)
df_sales

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank
0       A  North          10    100     1000           7.0
1       B  South          15    200     3000           1.5
2       C   East          20    150     3000           1.5
3       A   West           5    100      500           9.0
4       B  North          10    200     2000           5.0
5       C  South          15    150     2250           3.5
6       A   East          10    100     1000           7.0
7       B   West           5    200     1000           7.0
8       C  North          15    150     2250           3.5

### Merging DataFrames

In [23]:
product_data = {'Product': ['A', 'B', 'C'], 'Category':['Electronics','Furniture','Aplliances']}
df_products = pd.DataFrame(product_data)
df_products

  Product     Category
0       A  Electronics
1       B    Furniture
2       C   Aplliances

In [24]:
df_merged = pd.merge(df_sales, df_products, on = 'Product')
df_merged

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank     Category
0       A  North          10    100     1000           7.0  Electronics
1       B  South          15    200     3000           1.5    Furniture
2       C   East          20    150     3000           1.5   Aplliances
3       A   West           5    100      500           9.0  Electronics
4       B  North          10    200     2000           5.0    Furniture
5       C  South          15    150     2250           3.5   Aplliances
6       A   East          10    100     1000           7.0  Electronics
7       B   West           5    200     1000           7.0    Furniture
8       C  North          15    150     2250           3.5   Aplliances

In [25]:
df_merged.groupby('Category')['Revenue'].sum()

Category
Aplliances     7500
Electronics    2500
Furniture      6000
Name: Revenue, dtype: int64